#Program id : recipe02




#양념갈비
marinated_beef = ("1.양념소스를 준비해주세요.\n",
                  "진간장 1컵, 설탕 반컵, 맛술 1컵, 물 1.5컵, 다진마늘 반컵, 생각 1숟가락, 다진 파 1컵, 참기름 1/3컵, 배즙 반컵, 후추조금\n",
                  "을 넣고 섞어주세요.\n",
                  "2.양념장과 갈비를 섞고 재워주세요.\n",
                  "3.양념이 잘 배어진 갈비를 맛잇게 구워주세요.")

#계란말이
omelet_roll = ("1.계란 4개를 풀어주세요.\n",
               "2.풀어진 계란에 당근이나 양파, 파 등을 잘게 썰어 기호에 맞게 넣어주세요.\n",
               "3.후라이판에 올리고 익으면 가장자리부터 돌돌 말아주세요.\n")

#가지무침
eggplant_salad = ("1.재료로는 가지 3개, 대파 1줄기, 통마늘 4톨이 필요합니다.\n",
                  "2.가지는 꼭지 부분을 손질하여 알뜰하게 끝까지 다 써주세요.\n",
                  "3.깨끗이 씻어 3등분해주시고 세로로 두어번 잘라 접시에 담아주세요.\n",
                  "4.썰어둔 가지는 비닐 랲이나 일회용 비닐봉지를 씌워 전자레인지에 2분씩 총 4번 돌려주세요.\n",
                  "5.마늘 4톨은 곱게 다지고 대파는 잘게 송송 썰어 준비해주세요.\n",
                  "6.가지는 전자레인지에서 꺼내 조금 식혀준 뒤 먹기좋게 찢어 준비해주세요.\n",
                  "7.찢어둔 가지에 진간장 1스푼, 참기름 1스품, 다진마늘 1스푼, 송송 썬 대파를 모두 넣고\n",
                  "통깨 2스푼을 잘 갈아서 깨소금을 만들어 잘 버무려주세요.")

#오이무침
cucumber_salad = ("1.오이는 굵은 소금이나 천일염으로 박박 문질러서 깨끗이 씻어주세요.\n",
                "2.오이를 먹기 좋은 크기로 썰고, 천일염 반큰술에 십분정도 절여주세요.\n",
                "3.절인 오이를 물로 한번 행궈 물기를 빼주세요.\n",
                "4.오이와 양파 반개, 부추 한 줌, 고춧가루 2쿤술, 소금 반큰술, 멸치액젓 1~2큰술, 식초 2큰술, 올리고당 1~1.5큰술, 매실액 1큰술, 다진마늘 1큰술, 참기름 1.5큰술\n",
                "을 넣고 섞어주세요.\n"
                "5.잘 버무린 뒤에 깨를 솔솔 뿌려주세요.")
            


                  
#상추샐러드
lettuce_salad = ("1.상추를 깨끗이 씻고 먹기좋게 잘라 주세요.\n",
                 "2.발사믹 소스를 두르고 잘 섞어주세요.\n",
                 "3.기호에 맞게 견과류(호두, 땅콩 등)나 소고기, 닭가슴살 등을 올려주세요.")

#두부구이
grilled_tofu = ("1.키친타올을 깔고 두부를 올린뒤 소금을 뿌려서 잠시 재워주세요.\n",
                "2.재워두었던 두부의 물기를 제거하고 기름을 두르고 구워주세요.\n",
                "3.기회에 따라 홍고추를 같이 구워주면 매콤한 향이 나 더욱 맛있습니다.")

                
#가지구이
grilled_eggplant = ("1.앙념장을 먼저 만들게요.\n",
                    "부추와 대파를 잘게 썰고, 다진마늘과 고춧가루, 깨, 설탱을 넣고, 간장을 재료들이 살짝 잠길정도로만 넣고 섞어주세요.\n",
                    "참기름까지 넣고 섞으면 간장양념장이 완성됩니다. 매콤한 맛을 원하시면 청양고추를 조금 넣는 것도 좋아요.\n",
                    "2.가지를 오이소박이처럼 잘라주시고, 팬에 가지를 올려 구워주세요. 이때 식용유는 안넣으셔도 됩니다.\n",
                    "3.구운가지를 가지런히 놓고 그위에 양념장을 적절히 뿌려주세요."

                    
표고버섯 볶음
fried_shiitake = ("")                    
과일요거트
갈치조림
가지나물
조기구이
계란채소말이
아보카도 샐러드


    
